# MoveNext Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilteredWorksetIdIterator..::..MoveNext Method
FilteredWorksetIdIterator Class See Also
---
Increments the iterator to the next workset id passing the filter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public virtual bool MoveNext()
```

Visual Basic
---
```text
Public Overridable Function MoveNext As Boolean
```

Visual C++
---
```text
public:
virtual bool MoveNext()
```

# ### Return Value
True if there is another available workset id passing the filter in this iterator. False if the iterator has completed all available workset ids.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The FilteredWorksetCollector that yielded this iterator has been reset by another operation. No further iteration is permitted with this iterator. |

# See Also
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace